Tekla Open API Reference for Tekla Structures 2025
Identifier.Equals Method (Object)
 Compares the identifier with another object instance.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Equals(
	Object otherObject
)
Public Overrides Function Equals (
	otherObject As Object
) As Boolean
Parameters
otherObject
Type: System.Object
The object to compare with.
Return Value
Type: Boolean
True if the objects are equal, false otherwise.
See Also
Reference
Identifier Class
Equals Overload
Tekla.Structures Namespace